import card_1 from '../images/card1.png';
import card_2 from '../images/card2.png';
import card_3 from '../images/card3.png';
import card_4 from '../images/card4.png';
import card_5 from '../images/card5.png';
import card_6 from '../images/card6.png';

export const searchExample = [
    {
        source: {
            name: 'лента.ру',
            url: 'https://lenta.ru'
        },
        urlToImage: card_1,
        publishedAt: '2 августа, 2019',
        title: 'Национальное достояние – парки',
        description: 'В 2016 году Америка отмечала важный юбилей: сто лет назад здесь начала складываться система национальных парков – охраняемых территорий, где и сегодня каждый может приобщиться к природе.',
        keyword: 'Природа'
    },
    {
        source: {
            name: 'медуза',
            url: 'https://meduza.io'
        },
        urlToImage: card_2,
        publishedAt: '2 августа, 2019',
        title: 'Лесные огоньки: история одной фотографии',
        description: 'Фотограф отвлеклась от освещения суровой политической реальности Мексики, чтобы запечатлеть ускользающую красоту одного из местных чудес природы.',
        keyword: 'Природа'
    },
    {
        source: {
            name: 'РИА',
            url: 'https://ria.ru'
        },
        urlToImage: card_3,
        publishedAt: '2 августа, 2019',
        title: '«Первозданная тайга»: новый фотопроект Игоря Шпиленка',
        description: 'Знаменитый фотограф снимает первозданные леса России, чтобы рассказать о необходимости их сохранения. В этот раз он отправился в Двинско-Пинежскую тайгу, где теперь наконец-то может появиться.',
        keyword: 'Тайга'
    }
];

export const newsExample = [
    {
        source: {
            name: 'ДЗЕН',
            url: 'https://zen.yandex.ru/'
        },
        urlToImage: card_4,
        publishedAt: '2 августа, 2019',
        title: 'Национальное достояние – парки',
        description: 'В 2016 году Америка отмечала важный юбилей: сто лет назад здесь начала складываться система национальных парков – охраняемых территорий, где и сегодня каждый может приобщиться к природе.',
        keyword: 'Природа'
    },
    {
        source: {
            name: 'АФИША',
            url: 'https://www.afisha.ru/'
        },
        urlToImage: card_5,
        publishedAt: '2 августа, 2019',
        title: 'Лесные огоньки: история одной фотографии',
        description: 'Фотограф отвлеклась от освещения суровой политической реальности Мексики, чтобы запечатлеть ускользающую красоту одного из местных чудес природы.',
        keyword: 'Природа'
    },
    {
        source: {
            name: 'МЕДИАЗОНА',
            url: 'https://zona.media/'
        },
        urlToImage: card_6,
        publishedAt: '2 августа, 2019',
        title: '«Первозданная тайга»: новый фотопроект Игоря Шпиленка',
        description: 'Знаменитый фотограф снимает первозданные леса России, чтобы рассказать о необходимости их сохранения. В этот раз он отправился в Двинско-Пинежскую тайгу, где теперь наконец-то может появиться.',
        keyword: 'Тайга'
    },
    {
        source: {
            name: 'ДЗЕН',
            url: 'https://zen.yandex.ru/'
        },
        urlToImage: card_4,
        publishedAt: '2 августа, 2019',
        title: 'Национальное достояние – парки',
        description: 'В 2016 году Америка отмечала важный юбилей: сто лет назад здесь начала складываться система национальных парков – охраняемых территорий, где и сегодня каждый может приобщиться к природе.',
        keyword: 'Парки'
    },
    {
        source: {
            name: 'АФИША',
            url: 'https://www.afisha.ru/'
        },
        urlToImage: card_5,
        publishedAt: '2 августа, 2019',
        title: 'Лесные огоньки: история одной фотографии',
        description: 'Фотограф отвлеклась от освещения суровой политической реальности Мексики, чтобы запечатлеть ускользающую красоту одного из местных чудес природы.',
        keyword: 'Фотография'
    }
];
